Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 150, 150, 32)      7808      	Conv2D(32, kernel_size=(9, 9), padding='same')
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 75, 75, 32)        0         	MaxPooling2D((2, 2))
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 75, 75, 64)        100416    	Conv2D(64, (7, 7), padding='same')
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 37, 37, 64)        0         	MaxPooling2D((2, 2)
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 37, 128)       204928    	Conv2D(128, (5, 5), padding='same')
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 37, 37, 128)       0         	MaxPooling2D((1, 1))
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 37, 37, 128)       409728    	Conv2D(128, (5, 5), padding='same')
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 18, 18, 128)       0         	MaxPooling2D((2, 2))
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 18, 18, 128)       147584    	Conv2D(128, (3, 3), padding='same')
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 9, 9, 128)         0         	MaxPooling2D((2, 2))
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 9, 9, 128)         147584    	Conv2D(128, (3, 3), padding='same')
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 9, 9, 128)         0         	MaxPooling2D((1, 1))
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 9, 9, 256)         295168    	Conv2D(256, (3, 3), padding='same')
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 4, 4, 256)         0         	MaxPooling2D((2, 2))
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 2, 2, 256)         590080    	Conv2D(256, (3, 3)) default padding = valid 4 - 3 + 1 = 2 
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 1, 1, 256)         0         	MaxPooling2D((2, 2))
_________________________________________________________________
flatten (Flatten)            (None, 256)               0         	Flatten()
_________________________________________________________________
dense (Dense)                (None, 512)               131584    
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 513       
=================================================================
Total params: 2,035,393
Trainable params: 2,035,393
Non-trainable params: 0