Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 150, 150, 32)      7808           Conv2D(32, kernel_size=(9, 9), padding='same') 
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 75, 75, 32)        0              MaxPooling2D((2, 2)    
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 75, 75, 64)        100416         Conv2D(64, (7, 7), padding='same')
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 37, 37, 64)        0              MaxPooling2D((2, 2)
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 33, 33, 128)       204928         Conv2D(128, (5, 5)) default padding = 'valid' 37 - 5 + 1 = 33
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 16, 16, 128)       0              MaxPooling2D((2, 2)
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 128)       147584         Conv2D(128, (3, 3), padding='same')
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 128)         0              MaxPooling2D((2, 2)
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 8, 256)         295168         Conv2D(256, (3, 3), padding='same')
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 4, 4, 256)         0              MaxPooling2D((2, 2)
_________________________________________________________________     
conv2d_5 (Conv2D)            (None, 2, 2, 256)         590080         Conv2D(256, (3, 3))    4 - 3 + 1 = 2
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 256)         0              MaxPooling2D((2, 2)
_________________________________________________________________
flatten (Flatten)            (None, 256)               0              Flatten())
_________________________________________________________________ 
dense (Dense)                (None, 512)               131584         Dense(512)
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 513            Dense(1)
=================================================================
Total params: 1,478,081
Trainable params: 1,478,081
Non-trainable params: 0